app/Controllers/Pegawai.php

    public function index()
    {
        $jumlahBaris = 2;
        $katakunci = $this->request->getGet('katakunci');
        if ($katakunci){
            $pencarian = $this->model->cari($katakunci);
        } else {
            $pencarian = $this->model;
        }
        $data['katakunci'] = $katakunci;
        $data['dataPegawai'] = $pencarian->orderBy('id','desc',)->paginate($jumlahBaris);
---
SELECT *
FROM `pegawai`
ORDER BY `id` DESC
 LIMIT 2
SELECT COUNT(*) AS `numrows`
FROM `pegawai`